Revit 2024 API
RevisionNumberingSequence.GetAlphanumericRevisionSettings Method
 Returns a copy of the AlphanumericRevisionSettings owned by this revision numbering sequence.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public AlphanumericRevisionSettings GetAlphanumericRevisionSettings()
Visual Basic
Public Function GetAlphanumericRevisionSettings As AlphanumericRevisionSettings
Visual C++
public:
AlphanumericRevisionSettings^ GetAlphanumericRevisionSettings()
Return Value
 The copy of the AlphaumericRevisionSettings owned by this revision numbering sequence.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This RevisionNumberingSequence doesn't own a valid alphanumeric revision settings.
See Also
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace